david-sawatzke/swm050-rs/SWM050.svd
<?xml version="1.0" encoding="utf-8"?>

<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>SWM050</name>
  <version>0.1</version>
  <description>SWM050 Microcontroller registers</description>
  
  
  <addressUnitBits>8</addressUnitBits>
  
  <width>32</width>

  
  
  <size>32</size>
  
  <access>read-write</access>
  
  <resetValue>0</resetValue>
  
  <resetMask>0</resetMask>

  <peripherals>
  <peripheral>
  <name>SYS</name>
  <description>Registers group</description>
  <groupName>SYS</groupName>
  <baseAddress>0x400F0000</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>CLK_CFG</name>
  <description>CLK_CFG</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>CORE_CLK_DIV</name>
  <description>=0：2分频			=奇数：不分频		=偶数 分频</description>
  <bitOffset>0</bitOffset>
  <bitWidth>10</bitWidth>
  <access>read-write</access>
</field><field>
  <name>TMRSE_CLK_DIV</name>
  <description>=0：2分频			=奇数：不分频		=偶数 分频，直接对时钟源分频，不依赖于内核时钟</description>
  <bitOffset>16</bitOffset>
  <bitWidth>6</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>PCLK_EN</name>
  <description>PCLK_EN</description>
  <addressOffset>0x00000004</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>WDT_CLK</name>
  <description>WDT_CLK</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>TMRSE0_CLK</name>
  <description>TMRSE0_CLK</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>TMRSE1_CLK</name>
  <description>TMRSE1_CLK</description>
  <bitOffset>17</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>DBL_IRC</name>
  <description>DBL_IRC</description>
  <addressOffset>0x00000008</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>DBL_IRC</name>
  <description>0 18MHz	   1 36MHz</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>OSC_DIS</name>
  <description>OSC_DIS</description>
  <addressOffset>0x0000000C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>OSC_DIS</name>
  <description>OSC_DIS</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PWR_DWN</name>
  <description>1 Power-down</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MOS_DIS</name>
  <description>MOS_DIS</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register></registers>
</peripheral><peripheral>
  <name>PORT</name>
  <description>Registers group</description>
  <groupName>PORT</groupName>
  <baseAddress>0x40000030</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>SWD_SEL</name>
  <description>SWD_SEL</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>EN</name>
  <description>0 A1/A2功能由PORT_SEL决定		1 A1/A2连接到SWD功能，分别为SWDIO/SWCLK功能</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>PORTA_SEL</name>
  <description>PORTA_SEL</description>
  <addressOffset>0x00000050</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>PA00</name>
  <description>00 GPIO	   01 TMRSE0_IN	 	10/11 </description>
  <bitOffset>0</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA01</name>
  <description>00 GPIO	   01 TMRSE0_OUT	10/11 </description>
  <bitOffset>2</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA02</name>
  <description>00 GPIO	   01 TMRSE1_IN	 	10/11 </description>
  <bitOffset>4</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA03</name>
  <description>00 GPIO	   01 				10/11</description>
  <bitOffset>6</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA04</name>
  <description>00 GPIO	   01 				10/11</description>
  <bitOffset>8</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA05</name>
  <description>00 GPIO	   01 				10/11</description>
  <bitOffset>10</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA06</name>
  <description>00 GPIO	   01	  			10/11</description>
  <bitOffset>12</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA07</name>
  <description>00 GPIO	   01 TMRSE1OUT	 	10/11</description>
  <bitOffset>14</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA08</name>
  <description>00 GPIO	   01			   	10/11</description>
  <bitOffset>16</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA09</name>
  <description>00 GPIO	   01			   	10/11</description>
  <bitOffset>18</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>PORTA_PULLU</name>
  <description>PORTA_PULLU</description>
  <addressOffset>0x00000060</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>PA00</name>
  <description>0 上拉关闭		1 上拉开启</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA01</name>
  <description>PA01</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA02</name>
  <description>PA02</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA03</name>
  <description>PA03</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA04</name>
  <description>PA04</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA05</name>
  <description>PA05</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA06</name>
  <description>PA06</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA07</name>
  <description>PA07</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA08</name>
  <description>PA08</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA09</name>
  <description>PA09</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>PORTA_INDIS</name>
  <description>PORTA_INDIS</description>
  <addressOffset>0x000000B0</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>PA00</name>
  <description>0 GPIOA.0输入功能不禁止	1 GPIOA.0输入功能禁止，以降低功耗</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA01</name>
  <description>PA01</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA02</name>
  <description>PA02</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA03</name>
  <description>PA03</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA04</name>
  <description>PA04</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA05</name>
  <description>PA05</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA06</name>
  <description>PA06</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA07</name>
  <description>PA07</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA08</name>
  <description>PA08</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>PA09</name>
  <description>PA09</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register></registers>
</peripheral><peripheral>
  <name>GPIOA</name>
  <description>Registers group</description>
  <groupName>GPIOA</groupName>
  <baseAddress>0x40001000</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>DAT</name>
  <description>DAT</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>DAT_0</name>
  <description>DAT_0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_1</name>
  <description>DAT_1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_2</name>
  <description>DAT_2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_3</name>
  <description>DAT_3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_4</name>
  <description>DAT_4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_5</name>
  <description>DAT_5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_6</name>
  <description>DAT_6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_7</name>
  <description>DAT_7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_8</name>
  <description>DAT_8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DAT_9</name>
  <description>DAT_9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>DIR</name>
  <description>DIR</description>
  <addressOffset>0x00000004</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>DIR_0</name>
  <description>DIR_0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_1</name>
  <description>DIR_1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_2</name>
  <description>DIR_2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_3</name>
  <description>DIR_3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_4</name>
  <description>DIR_4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_5</name>
  <description>DIR_5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_6</name>
  <description>DIR_6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_7</name>
  <description>DIR_7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_8</name>
  <description>DIR_8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>DIR_9</name>
  <description>DIR_9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register></registers>
</peripheral><peripheral>
  <name>GPIO_EXTA</name>
  <description>Registers group</description>
  <groupName>GPIO_EXTA</groupName>
  <baseAddress>0x40001050</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>EXT</name>
  <description>EXT</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-only</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>EXT0</name>
  <description>EXT0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT1</name>
  <description>EXT1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT2</name>
  <description>EXT2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT3</name>
  <description>EXT3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT4</name>
  <description>EXT4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT5</name>
  <description>EXT5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT6</name>
  <description>EXT6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT7</name>
  <description>EXT7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT8</name>
  <description>EXT8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EXT9</name>
  <description>EXT9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register></registers>
</peripheral><peripheral>
  <name>ACMP</name>
  <description>Registers group</description>
  <groupName>ACMP</groupName>
  <baseAddress>0x40000800</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>CPEN</name>
  <description>CPEN</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>EN</name>
  <description>EN</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPLEVEL</name>
  <description>CPLEVEL</description>
  <addressOffset>0x00000004</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>LEVEL</name>
  <description>LEVEL</description>
  <bitOffset>0</bitOffset>
  <bitWidth>8</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPOUTPUT</name>
  <description>CPOUTPUT</description>
  <addressOffset>0x00000010</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>CPOUTRAW</name>
  <description>CPOUTRAW</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPOUTMOS</name>
  <description>CPOUTMOS</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPOUTCEL</name>
  <description>CPOUTCEL</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPMOD</name>
  <description>CPMOD</description>
  <addressOffset>0x00000020</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>WORKSMOD</name>
  <description>WORKSMOD</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPCTL</name>
  <description>CPCTL</description>
  <addressOffset>0x00000024</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>MOS_LEVEL</name>
  <description>MOS_LEVEL</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CEL_LEVEL</name>
  <description>CEL_LEVEL</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>A7M_LEVEL</name>
  <description>A7M_LEVEL</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>A7C_LEVEL</name>
  <description>A7C_LEVEL</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MOS_DELAY</name>
  <description>MOS_DELAY</description>
  <bitOffset>8</bitOffset>
  <bitWidth>6</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CEL_DELAY</name>
  <description>CEL_DELAY</description>
  <bitOffset>16</bitOffset>
  <bitWidth>6</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CLRLOCK</name>
  <description>CLRLOCK</description>
  <addressOffset>0x00000028</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>CLR</name>
  <description>CLR</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>LOCKCON</name>
  <description>LOCKCON</description>
  <addressOffset>0x0000002C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>LOCKEN</name>
  <description>LOCKEN</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>LEVELCON</name>
  <description>LEVELCON</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CLRCON</name>
  <description>CLRCON</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>LOCKSTAT</name>
  <description>LOCKSTAT</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPINTCON</name>
  <description>CPINTCON</description>
  <addressOffset>0x00000040</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTMASKn</name>
  <description>INTMASKn</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTUP</name>
  <description>INTUP</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTDOWN</name>
  <description>INTDOWN</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MOSINTMASKn</name>
  <description>MOSINTMASKn</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MOSINTEN</name>
  <description>MOSINTEN</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MOSINTUP</name>
  <description>MOSINTUP</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MOSINTDOWN</name>
  <description>MOSINTDOWN</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPINTRAW</name>
  <description>CPINTRAW</description>
  <addressOffset>0x00000044</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>CPRAW</name>
  <description>CPRAW</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPMOS</name>
  <description>CPMOS</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPCEL</name>
  <description>CPCEL</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPINT</name>
  <description>CPINT</description>
  <addressOffset>0x00000048</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>CPRAW</name>
  <description>CPRAW</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPMOS</name>
  <description>CPMOS</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPCEL</name>
  <description>CPCEL</description>
