david-sawatzke/swm050-rs/SWM050.svd
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPINTOF</name>
  <description>CPINTOF</description>
  <addressOffset>0x0000004C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>CPRAW</name>
  <description>CPRAW</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPMOS</name>
  <description>CPMOS</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPCEL</name>
  <description>CPCEL</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CPINTCLR</name>
  <description>CPINTCLR</description>
  <addressOffset>0x00000050</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>CPRAW</name>
  <description>CPRAW</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPMOS</name>
  <description>CPMOS</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>CPCEL</name>
  <description>CPCEL</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register></registers>
</peripheral><peripheral>
  <name>EXTIA</name>
  <description>Registers group</description>
  <groupName>EXTIA</groupName>
  <baseAddress>0x40001030</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>INTEN</name>
  <description>INTEN</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTEN0</name>
  <description>INTEN0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN1</name>
  <description>INTEN1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN2</name>
  <description>INTEN2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN3</name>
  <description>INTEN3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN4</name>
  <description>INTEN4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN5</name>
  <description>INTEN5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN6</name>
  <description>INTEN6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN7</name>
  <description>INTEN7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN8</name>
  <description>INTEN8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTEN9</name>
  <description>INTEN9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTMSK</name>
  <description>INTMSK</description>
  <addressOffset>0x00000004</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTMSK0</name>
  <description>INTMSK0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK1</name>
  <description>INTMSK1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK2</name>
  <description>INTMSK2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK3</name>
  <description>INTMSK3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK4</name>
  <description>INTMSK4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK5</name>
  <description>INTMSK5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK6</name>
  <description>INTMSK6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK7</name>
  <description>INTMSK7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK8</name>
  <description>INTMSK8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMSK9</name>
  <description>INTMSK9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTMODE</name>
  <description>INTMODE</description>
  <addressOffset>0x00000008</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTMODE0</name>
  <description>INTMODE0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE1</name>
  <description>INTMODE1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE2</name>
  <description>INTMODE2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE3</name>
  <description>INTMODE3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE4</name>
  <description>INTMODE4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE5</name>
  <description>INTMODE5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE6</name>
  <description>INTMODE6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE7</name>
  <description>INTMODE7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE8</name>
  <description>INTMODE8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTMODE9</name>
  <description>INTMODE9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTLEVEL</name>
  <description>INTLEVEL</description>
  <addressOffset>0x0000000C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTLEVEL0</name>
  <description>INTLEVEL0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL1</name>
  <description>INTLEVEL1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL2</name>
  <description>INTLEVEL2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL3</name>
  <description>INTLEVEL3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL4</name>
  <description>INTLEVEL4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL5</name>
  <description>INTLEVEL5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL6</name>
  <description>INTLEVEL6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL7</name>
  <description>INTLEVEL7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL8</name>
  <description>INTLEVEL8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTLEVEL9</name>
  <description>INTLEVEL9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTSTAT</name>
  <description>INTSTAT</description>
  <addressOffset>0x00000010</addressOffset>
  <access>read-only</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTSTAT0</name>
  <description>INTSTAT0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT1</name>
  <description>INTSTAT1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT2</name>
  <description>INTSTAT2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT3</name>
  <description>INTSTAT3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT4</name>
  <description>INTSTAT4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT5</name>
  <description>INTSTAT5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT6</name>
  <description>INTSTAT6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT7</name>
  <description>INTSTAT7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT8</name>
  <description>INTSTAT8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTSTAT9</name>
  <description>INTSTAT9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTRAWS</name>
  <description>INTRAWS</description>
  <addressOffset>0x00000014</addressOffset>
  <access>read-only</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTRAWS0</name>
  <description>INTRAWS0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS1</name>
  <description>INTRAWS1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS2</name>
  <description>INTRAWS2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS3</name>
  <description>INTRAWS3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS4</name>
  <description>INTRAWS4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS5</name>
  <description>INTRAWS5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS6</name>
  <description>INTRAWS6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS7</name>
  <description>INTRAWS7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS8</name>
  <description>INTRAWS8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTRAWS9</name>
  <description>INTRAWS9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTCLR</name>
  <description>INTCLR</description>
  <addressOffset>0x0000001C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>INTCLR0</name>
  <description>INTCLR0</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR1</name>
  <description>INTCLR1</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR2</name>
  <description>INTCLR2</description>
  <bitOffset>2</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR3</name>
  <description>INTCLR3</description>
  <bitOffset>3</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR4</name>
  <description>INTCLR4</description>
  <bitOffset>4</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR5</name>
  <description>INTCLR5</description>
  <bitOffset>5</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR6</name>
  <description>INTCLR6</description>
  <bitOffset>6</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR7</name>
  <description>INTCLR7</description>
  <bitOffset>7</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR8</name>
  <description>INTCLR8</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>INTCLR9</name>
  <description>INTCLR9</description>
  <bitOffset>9</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register></registers>
</peripheral><peripheral>
  <name>WDT</name>
  <description>Registers group</description>
  <groupName>WDT</groupName>
  <baseAddress>0x40019000</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>CR</name>
  <description>CR</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>EN</name>
  <description>EN</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>RMOD</name>
  <description>0 超时即复位		1 第一次超时产生中断，若产生第二次超时时，没有清除中断，则系统复位</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>TORR</name>
  <description>TORR</description>
  <addressOffset>0x00000004</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>TOP</name>
  <description>初始值（在WDT使能之前写入值）	2^(8+TOP)，即24位</description>
  <bitOffset>0</bitOffset>
  <bitWidth>4</bitWidth>
  <access>read-write</access>
</field><field>
  <name>TOP_INIT</name>
  <description>超时后将要填装的值</description>
  <bitOffset>4</bitOffset>
  <bitWidth>4</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>CCVR</name>
  <description>CCVR</description>
  <addressOffset>0x00000008</addressOffset>
  <access>read-only</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>CRR</name>
  <description>CRR</description>
  <addressOffset>0x0000000C</addressOffset>
  <access>read-only</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>STAT</name>
  <description>STAT</description>
  <addressOffset>0x00000010</addressOffset>
  <access>read-only</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>ICLR</name>
  <description>ICLR</description>
  <addressOffset>0x00000014</addressOffset>
  <access>read-only</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register></registers>
</peripheral><peripheral>
  <name>TMRSE0</name>
  <description>Registers group</description>
  <groupName>TMRSE0</groupName>
  <baseAddress>0x40002000</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>CTRL</name>
  <description>CTRL</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>ENA</name>
  <description>模块使能</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>WMOD</name>
  <description>00 定时器/计数器模式	01 PWM模式	10 脉宽捕捉模式		11 占空比捕捉模式</description>
  <bitOffset>4</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>OSCMOD</name>
  <description>0 内部	1 外部</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>OUTMOD</name>
  <description>00 无输出		01 取反		10 置高		11 置低</description>
  <bitOffset>12</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EDGE_F</name>
  <description>0 上升沿		1 下降沿</description>
  <bitOffset>16</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>VALSAVE</name>
  <description>保留计数值</description>
  <bitOffset>24</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>SINGLE</name>
  <description>1 单次模式 0 循环模式</description>
  <bitOffset>28</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>TARVAL</name>
  <description>TARVAL</description>
  <addressOffset>0x00000004</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>CURVAL</name>
  <description>CURVAL</description>
  <addressOffset>0x00000008</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>CAPVAL</name>
  <description>CAPVAL</description>
  <addressOffset>0x0000000C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>CAPHALF</name>
  <description>CAPHALF</description>
  <addressOffset>0x00000010</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>STATE_P</name>
  <description>STATE_P</description>
  <addressOffset>0x00000014</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>OUT_LVL</name>
  <description>OUT_LVL</description>
  <addressOffset>0x00000080</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>INTCTRL</name>
  <description>INTCTRL</description>
  <addressOffset>0x00000084</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>ENA</name>
  <description>1 使能	to observe sate, you should set this bit 1</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MASKn</name>
  <description>0 屏蔽</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTRSTAT</name>
  <description>INTRSTAT</description>
  <addressOffset>0x00000088</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>INTSTAT</name>
  <description>INTSTAT</description>
  <addressOffset>0x0000008C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>INTOFLAG</name>
  <description>INTOFLAG</description>
  <addressOffset>0x00000090</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register></registers>
</peripheral><peripheral>
  <name>TMRSE1</name>
  <description>Registers group</description>
  <groupName>TMRSE1</groupName>
  <baseAddress>0x40002400</baseAddress>
  <addressBlock>
    <offset>0x00000000</offset>
    <size>0x00000800</size>
    <usage>registers</usage>
  </addressBlock>
  <registers>
  <register>
  <name>CTRL</name>
  <description>CTRL</description>
  <addressOffset>0x00000000</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>ENA</name>
  <description>模块使能</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>WMOD</name>
  <description>00 定时器/计数器模式	01 PWM模式	10 脉宽捕捉模式		11 占空比捕捉模式</description>
  <bitOffset>4</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>OSCMOD</name>
  <description>0 内部	1 外部</description>
  <bitOffset>8</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>OUTMOD</name>
  <description>00 无输出		01 取反		10 置高		11 置低</description>
  <bitOffset>12</bitOffset>
  <bitWidth>2</bitWidth>
  <access>read-write</access>
</field><field>
  <name>EDGE_F</name>
  <description>0 上升沿		1 下降沿</description>
