david-sawatzke/swm050-rs/SWM050.svd
  <bitOffset>16</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>VALSAVE</name>
  <description>保留计数值</description>
  <bitOffset>24</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>SINGLE</name>
  <description>1 单次模式 0 循环模式</description>
  <bitOffset>28</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>TARVAL</name>
  <description>TARVAL</description>
  <addressOffset>0x00000004</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>CURVAL</name>
  <description>CURVAL</description>
  <addressOffset>0x00000008</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>CAPVAL</name>
  <description>CAPVAL</description>
  <addressOffset>0x0000000C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>CAPHALF</name>
  <description>CAPHALF</description>
  <addressOffset>0x00000010</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>STATE_P</name>
  <description>STATE_P</description>
  <addressOffset>0x00000014</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>OUT_LVL</name>
  <description>OUT_LVL</description>
  <addressOffset>0x00000080</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>INTCTRL</name>
  <description>INTCTRL</description>
  <addressOffset>0x00000084</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  <field>
  <name>ENA</name>
  <description>1 使能	to observe sate, you should set this bit 1</description>
  <bitOffset>0</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field><field>
  <name>MASKn</name>
  <description>0 屏蔽</description>
  <bitOffset>1</bitOffset>
  <bitWidth>1</bitWidth>
  <access>read-write</access>
</field></fields>
</register><register>
  <name>INTRSTAT</name>
  <description>INTRSTAT</description>
  <addressOffset>0x00000088</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>INTSTAT</name>
  <description>INTSTAT</description>
  <addressOffset>0x0000008C</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register><register>
  <name>INTOFLAG</name>
  <description>INTOFLAG</description>
  <addressOffset>0x00000090</addressOffset>
  <access>read-write</access>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <fields>
  </fields>
</register></registers>
</peripheral></peripherals>
</device>